import { MathQuestion } from "../services/QuestionService";

export const m5Questions: MathQuestion[] = [
  {
    id: "1",
    question: "โยนเหรียญเสี่ยงทาย 2 ครั้ง ความน่าจะเป็นที่จะออกหัวเพียงครั้งเดียวคือเท่าใด?",
    answer: {
      "1": "1/2",
      "2": "1/4",
      "3": "3/4",
      "4": "2/3"
    },
    correctAnswerId: "1"
  },
  // {
  //   id: "2",
  //   question: "ทอยลูกเต๋าแต้มธรรมดา 1 ลูก 1 ครั้ง ความน่าจะเป็นที่จะได้จำนวนเฉพาะคือเท่าใด?",
  //   answer: {
  //     "1": "1/3",
  //     "2": "1/2",
  //     "3": "2/3",
  //     "4": "1/6"
  //   },
  //   correctAnswerId: "2"
  // },
  // {
  //   id: "3",
  //   question: "หยิบไพ่ 1 ใบจากไพ่ 52 ใบ ความน่าจะเป็นที่จะได้โพธิ์แดงหรือข้าวหลามตัดคือเท่าใด?",
  //   answer: {
  //     "1": "1/4",
  //     "2": "3/4",
  //     "3": "1/2",
  //     "4": "13/52"
  //   },
  //   correctAnswerId: "3"
  // },
  // {
  //   id: "4",
  //   question: "หยิบไพ่ 1 ใบจากไพ่ 52 ใบ ความน่าจะเป็นที่จะได้ไพ่หน้า (J, Q, K) คือเท่าใด?",
  //   answer: {
  //     "1": "3/13",
  //     "2": "1/4",
  //     "3": "1/13",
  //     "4": "12/26"
  //   },
  //   correctAnswerId: "1"
  // },
  // {
  //   id: "5",
  //   question: "ถุงหนึ่งมีลูกบอลสีแดง 5 ลูก สีน้ำเงิน 3 ลูก และสีเขียว 2 ลูก หากหยิบขึ้นมา 1 ลูก ความน่าจะเป็นที่จะได้สีแดงคือเท่าใด?",
  //   answer: {
  //     "1": "1/5",
  //     "2": "1/2",
  //     "3": "5/9",
  //     "4": "5/10"
  //   },
  //   correctAnswerId: "2"
  // },
  // {
  //   id: "6",
  //   question: "ถุงหนึ่งมีลูกบอลสีแดง 3 ลูก และสีน้ำเงิน 2 ลูก หยิบขึ้นมา 2 ลูกพร้อมกันโดยไม่คืน ความน่าจะเป็นที่จะได้สีแดงทั้งสองลูกคือเท่าใด?",
  //   answer: {
  //     "1": "3/10",
  //     "2": "2/5",
  //     "3": "1/3",
  //     "4": "3/5"
  //   },
  //   correctAnswerId: "1"
  // },
  // {
  //   id: "7",
  //   question: "โยนเหรียญ 3 เหรียญพร้อมกัน ความน่าจะเป็นที่จะออกหัวอย่างน้อย 2 เหรียญคือเท่าใด?",
  //   answer: {
  //     "1": "3/8",
  //     "2": "1/2",
  //     "3": "5/8",
  //     "4": "1/4"
  //   },
  //   correctAnswerId: "2"
  // },
  // {
  //   id: "8",
  //   question: "ทอยลูกเต๋า 2 ลูกพร้อมกัน ความน่าจะเป็นที่ผลรวมเป็น 7 คือเท่าใด?",
  //   answer: {
  //     "1": "1/12",
  //     "2": "1/9",
  //     "3": "1/6",
  //     "4": "2/9"
  //   },
  //   correctAnswerId: "3"
  // },
  // {
  //   id: "9",
  //   question: "ในห้องมีนักเรียนหญิง 7 คน และนักเรียนชาย 5 คน หากสุ่มเลือกนักเรียน 1 คน ความน่าจะเป็นที่จะได้ผู้ชายคือเท่าใด?",
  //   answer: {
  //     "1": "5/12",
  //     "2": "7/12",
  //     "3": "1/2",
  //     "4": "5/7"
  //   },
  //   correctAnswerId: "1"
  // },
  // {
  //   id: "10",
  //   question: "ทอยลูกเต๋า 1 ลูก ให้เหตุการณ์ A คือได้เลขคู่ และ B คือได้จำนวนที่มากกว่า 3 จงหาความน่าจะเป็นของ A ∩ B",
  //   answer: {
  //     "1": "1/2",
  //     "2": "1/3",
  //     "3": "1/6",
  //     "4": "2/3"
  //   },
  //   correctAnswerId: "2"
  // }
];
